# familia
familia = {
    'Родители считают, что во мне больше достоинств, чем недостатков.': '3',
    'В семье уважают мое мнение и считаются с ним.': '3',
    'Я чувствую, что родители меня любят.': '3',
    'Я чувствую, что дома мне доверяют.': '3',
    'Дома интересуются моей жизнью.': '3',
    'Родители уважают во мне личность.': '3',
    'Моим родителям нравятся мои увлечения.': '3',
    'Если у родителей есть свободное время, то они стараются провести его вместе со мной.': '3',
    'Я знаю, что своим родителям я нравлюсь таким, какой (ая) я есть.': '3',
    'В семье считают, что я добьюсь больших успехов в жизни.': '3',
    }

# КЛАСС
clas = {
    'В группе, где я учусь, есть такой человек, которому я могу рассказать о своих проблемах.': '3',
    'Я думаю, что студенты, обучающиеся со мной в одной группе, относятся ко мне хорошо.': '3',
    'Сокурсники, которые учатся вместе со мной в одной группе, прислушиваются к моему мнению.': '3',
    'У меня редко возникают конфликты с сокурсниками.': '3',
    'Я думаю, что студентам моей группы интересно проводить со мной свободное время.': '3',
    'Я думаю, что мои сокурсники будут жалеть, если мне придется перейти в другое учебное заведение.': '3',
    'Студенты моей группы помогают мне, когда я нахожусь в сложной ситуации.': '3',
    'Студенты моей группы приветливы и доброжелательны со мной.': '3',
    'Среди сокурсников, обучающихся со мной в одной группе, я не чувствую себя лишним.': '3',
    }

# amigos
amigos = {
    'Мне нравятся все мои знакомые.': '3',
    'У меня есть знакомый, просьбы и желания которого я выполню не задумываясь.': '3',
    'Мне интересно знакомиться с новыми людьми.': '3',
    'Ко всем моим знакомым я отношусь с симпатией.': '3',
    'Мне важно, что обо мне думают друзья или знакомые.': '3',
    }

# chestnost
chestnost = {
    'Я всегда общаюсь только на темы, в которых хорошо разбираюсь.': '3',
    'Я всегда говорю только о том, в чем хорошо разбираюсь.': '3',
    'Я всегда сдерживаю свои обещания.': '2',
    'Все что я обещаю я всегда выполняю, даже если меня никто не проверяет.': '2',
    'Я всегда говорю только правду.': '3',
    'У меня со студентами моей группы хорошие отношения.': '3',
    'Я всегда делаю и говорю одно и то же.': '3',
    'Мое слово всегда совпадает с делом.': '3',
    'Я могу довести начатое дело до конца, если даже возникает желание его бросить.': '3',
    }
no_chestnost = {
    'Я никогда не обманываю.': '0',
    'Я считаю, почти каждый солжет, чтобы избежать неприятностей.': '0',
    'Я думаю, что большинство людей склонны солгать в своих интересах.': '0',
    }

# crimen
crimen = {
    'Некоторые из моих знакомых рассказывали мне, что пробовали или употребляли наркотики.': '0',
    'Я видел (а) как мои знакомые употребляли наркотики.': '0',
    'Мне кажется, что самые лучшие вещи происходят, когда человек позволяет себе быть совершенно свободным от правил.': '0',
    'Я слышал, что моим знакомым предлагали попробовать наркотическое вещество.': '0',
    'Среди моих знакомых есть такие, которые считают, что употребление наркотиков помогает справляться с жизненными трудностями.': '0',
    'Я готов нарушить запрет, если его нарушат и мои товарищи.': '0',
    'В моем окружении есть люди, которые лечатся от наркомании.': '0',
    'Я считаю, что взрослые часто запрещают детям что-то не потому, что это действительно опасно, а потому, что это неудобно им.': '0',
    'У меня не бывает запрещенных желаний и мыслей.': '2',
    'Я считаю, что большинство людей честны главным образом потому, что боятся попасться.': '0',
    'У меня есть друзья или близкие знакомые, пробовавшие наркотики.': '0',
    'У меня есть друзья или близкие знакомые, употребляющие наркотики.': '0',
    'Я считаю, что среди наркоманов есть хорошие люди, с которыми интересно поговорить.': '0',
    'Если я узнаю, что среди знакомых кто-то, пробует или употребляет наркотики я буду относится к нему, как и раньше.': '0',
    'Я думаю, что вполне допустимо обойти закон, если ты его прямо не нарушаешь.': '0',
    'Я думаю, что пытаясь полностью следовать правилам, люди часто упускают новые возможности.': '0',
    'В своей жизни мне довелось разговаривать с людьми, употребляющими наркотики.': '0',
    'Мне кажется, что большинство людей добиваются успеха в жизни не совсем честным путём.': '0',
    }

# extremo
extremo = {
    'Неожиданности и экстрим дарят мне интерес к жизни.': '1',
    'Мне кажется, что без риска жизнь будет скучной.': '0',
    'Я часто испытываю потребность в острых ощущениях.': '0',
    'Мне кажется, что бурная и опасная жизнь интереснее, чем спокойная и размеренная.': '0',
    'Мне нравится слушать рассказы о том, как можно экстремально провести время.': '1',
    'Мне нравится делать что-либо «на спор».': '1',
    'Мне нравятся занятия и увлечения, связанные с риском.': '1',
    'Я могу сесть в автомобиль, если знаю, что у него могут быть неисправны тормоза.': '1',
    'Мне нравится испытывать себя в разных ситуациях.': '1',
    'Я считаю, что в жизни нужно уметь рисковать.': '1',
    }

    # PDD
pdd = {
    'Я всегда соблюдаю правила при переходе улицы.': '3',
    'Даже когда я сильно тороплюсь, я соблюдаю правила дорожного движения.': '3',
    }

# tarde
tarde = {
    'Я никогда и никуда не опаздываю.': '0',
    'Везде и всегда я прихожу вовремя.': '0',
    }

# besheniy
besheniy = {
    'Если мне не удастся выиграть в какую-нибудь игру у моих сверстников, я обижусь и не буду больше играть.': '0',
    'После того как я проиграю в какую-нибудь игру я долго не могу успокоиться.': '0',
    'Когда я раздражаюсь, то не могу сдержаться и говорю все, что думаю.': '0',
    'Я сильно нервничаю, когда не получается достичь задуманного.': '0',
    'У меня вызывают раздражение люди, которые не могут быстро решиться на что-нибудь.': '1',
    'Вас злит, что кому-то везет в жизни больше, чем вам.': '0',
    'Когда у меня что-то не получается, я срываю зло или досаду на окружающих.': '0',
    }

# tugodum
tugodum = {
    'Мне не свойственно долго перебирать разные варианты при принятии решения.': '0',
    'Нередко я проигрываю из-за того, что недостаточно быстро принимаю решения.': '0',
    'У меня мало свободного времени.': '0',
    'Я скучаю при решении задач, требующих обдумывания.': '0',
    }

# tryapka
tryapka = {
    'Интересы, желания друзей или знакомых я часто ставлю выше своих собственных.': '0',

    'Когда моими друзьями или знакомыми принимается какое-либо решение, я стараюсь быть на стороне большинства, независимо от того правильное оно или нет.': '0',
    'Мне трудно принимать самостоятельные решения без помощи друзей или знакомых.': '0',
    'Мне трудно сказать "нет", когда меня о чем-либо просят.': '0',
    'Для меня мнение друзей или знакомых важнее, чем мое собственное.': '0',
    'Я всегда придерживаюсь своих планов, даже если приходится выбирать между ними и компанией друзей.': '1',
    'Мое поведение часто зависит от авторитетного мнения моих знакомых.': '1',
    }

# ne zoj
no_zoj = {
    'Я думаю, что люди, которые говорят, что что-то вредно для здоровья, часто просто перестраховываются.': '1',
    'Я думаю, что иногда здоровый образ жизни не так полезен, как кажется.': '0',
    }

# hero
hero = {
    'Я всегда довожу начатое дело до конца.': '3',
    'В неожиданных ситуациях я всегда знаю, как я должен (должна) себя вести.': '3',
    'Если мне что-либо мешает, то я все же нахожу пути достижения своей цели.': '3',
    'Я довольно хорошо справляюсь с большей частью ежедневных обязанностей.': '3',
    'Если передо мной встает какая-либо проблема, то я обычно нахожу несколько вариантов ее решения.': '3',
    'При необходимости, я могу заниматься своим делом даже в неудобной, неподходящей обстановке.': '3',
    'Мне хочется быть впереди других в любом деле.': '3',
    'Я готов(а) к любым трудностям, поскольку полагаюсь на собственные способности.': '3',
    'Я могу что-либо придумать даже в безвыходных на первый взгляд ситуациях.': '3',
    'Мне довольно просто удается достичь своих целей.': '3',
    'Я обычно способен(на) держать ситуацию под контролем.': '3',
    'Всегда стараюсь продумать способ достижения цели, прежде чем начинать действовать.': '3',
    'У меня не бывает мыслей, которые нужно скрывать от других.': '2',
    'Будет моя жизнь интересной или нет зависит от меня.': '3',
    'Я стараюсь избегать критических ситуаций и трудностей.': '3',
    'Я всегда охотно признаю свои шибки.': '3',
    'Я люблю заниматься спортом.': '3',
    'Моя жизнь наполнена интересными событиями и яркими впечатлениями.': '3',
    'Прежде чем начать какое-либо дело, я стараюсь собрать о нем как можно более полную информацию.': '3',
    'Если я как следует постараюсь, то я всегда найду решение даже сложным проблемам.': '3',
    'Если я приложу достаточно усилий, то смогу справиться с большинством проблем.': '3',
    'Я постоянно пытаюсь улучшить или изменить что-нибудь в своей жизни.': '3',
    'Обычно я сохраняю спокойствие в ожидании опаздывающего к назначенному времени друга или подруги.': '3',
    'В случае неудачи я всегда стараюсь понять, что мною сделано неправильно.': '3',
    'Я всегда стараюсь выслушать собеседника не перебивая, даже если не терпится ему возразить.': '3',
    'Я всегда соглашаюсь, когда мне указывают на мои ошибки.': '0',
    'Я стараюсь быть в курсе всего происходящего вокруг меня.': '3',
    'Мне нравится участвовать в конкурсах и соревнованиях.': '3',
    'При непредвиденно возникающих трудностях я верю, что смогу с ними справиться.': '3',
    'Мне легко долго сосредотачиваться на работе, которая мне не интересна.': '2',
    'Мне легко заставить себя переделать что-либо, когда меня не устраивает качество сделанного.': '3',
    'Начав дело, я всегда завершаю его.': '2',
    'Если я хочу что-нибудь сделать, но окружающие считают, что этого делать не стоит, то я готов отказаться от своих намерений.': '3'
    }

# ne hero
no_hero = {
    'Ожидаемые трудности, обычно, очень тревожат меня.': '2',
    'Я часто себя ругаю за поспешные решения.': '1',
    'При больших неприятностях я склонен без достаточных оснований винить себя.': '0',
    'Жизненные трудности выводят меня из равновесия и заставляют нервничать.': '0',
    'Когда у меня не получается добиться того, что я хочу, я чувствую отчаяние.': '0',
    'Неприятности меня сильно расстраивают, я падаю духом.': '0',
    'Нередко мне кажутся безвыходными положения, из которых можно найти выход.': '0',
    'Я слишком переживаю из-за пустяков.': '0',
    'Я так сильно переживаю свои разочарования, что потом долго не могу о них забыть.': '0',
    'Я часто нервничаю.': '0',
    'Меня охватывает беспокойство, когда я думаю о своих делах и заботах.': '0',
    'Меня сильно огорчает то, что не осуществляются планы и не сбываются надежды.': '0',
    'Я часто говорю, не подумав.': '0',
    'Мне кажется, что жизнь проходит мимо меня (проходит зря).': '0',
    'Я «ерзаю» сидя на занятиях или представлениях.': '0',
    'Я принимаю все слишком близко к сердцу.': '0',
    'Мне не хватает уверенности в себе.': '0',
    'Меня волнуют возможные неудачи.': '1',
    'В повседневной жизни я часто действую под влиянием момента, не думая о возможных последствиях.': '0',
    }

all_t_q = [familia, clas, amigos, [hero, no_hero], [chestnost, no_chestnost], pdd, tarde, tugodum, tryapka, no_zoj, extremo, besheniy, crimen]

from random import randint


class Character:
    def __init__(self, all_t_q):
        self.all_t_q = all_t_q

    _return_dict = {}

    # возвращает список характеристик из Type_Char.txt
    @staticmethod
    def _new_char_params():
        with open('Type_Char.txt', 'r', encoding="cp1251") as TC:
            dict_params = {}
            for line in TC:
                resp = ''
                line = line.strip()
                if 'URL:' not in line:
                    continue
                if line != '' and line[0] != '#':
                    split_line = line.split(':')
                    split_line = [i.strip() for i in split_line]

                    for i in split_line[-1]:
                        if len(resp) < 2 and i not in resp and i in ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0']:
                            resp += i

                    dict_params[split_line[0]] = ''.join(sorted(resp))

        return dict_params  # {'Семья': '3', 'Группа': '3}

    @classmethod
    def _set_char_params(cls, value, params, n=1):
        if n:
            if len(value) == 1:
                for k in params.keys():
                    params[k] = value
            elif len(value) == 2:
                for k in params.keys():
                    params[k] = randint(int(value[0]), int(value[-1]))
        if not n:
            value = ['3', '2', '1', '0'][int(value)]
            if len(value) == 1:
                for k in params.keys():
                    params[k] = value
            elif len(value) == 2:
                for k in params.keys():
                    params[k] = randint(int(value[0]), int(value[-1]))

        for k, v in params.items():
            cls._return_dict[k] = v

    def char_params(self):
        dict_params = self._new_char_params()
        i = 0
        for k, v in dict_params.items():
            if v != '':
                if k == 'Семья':
                    self._set_char_params(v, self.all_t_q[i])

                elif k == 'Группа':
                    self._set_char_params(v, self.all_t_q[i])

                elif k == 'Друзья':
                    self._set_char_params(v, self.all_t_q[i])

                elif k == 'Герой':
                    self._set_char_params(v, self.all_t_q[i][0])
                    self._set_char_params(v, self.all_t_q[i][1], 0)

                elif k == 'Честный':
                    self._set_char_params(v, self.all_t_q[i][0])
                    self._set_char_params(v, self.all_t_q[i][1], 0)

                elif k == 'ПДД':
                    self._set_char_params(v, self.all_t_q[i])

                elif k == 'Пунктуальный':
                    self._set_char_params(v, self.all_t_q[i])

                elif k == 'Тугодум':
                    self._set_char_params(v, self.all_t_q[i])

                elif k == 'Нерешительный':
                    self._set_char_params(v, self.all_t_q[i])

                elif k == 'ПротивЗОЖ':
                    self._set_char_params(v, self.all_t_q[i])

                elif k == 'Экстрим':
                    self._set_char_params(v, self.all_t_q[i])

                elif k == 'Вспыльчивость':
                    self._set_char_params(v, self.all_t_q[i])

                elif k == 'Криминал':
                    self._set_char_params(v, self.all_t_q[i])
            i += 1
        return self._return_dict


Person = Character(all_t_q)

